package com.ibs.idea;

/*
Первая программа
Написать первую программу, которая выводит в консоль строку “Hello World!”.
 */

public class Task1 {

    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
