package com.ibs.idea;

/*
Задача №2 - Типы данных
Создание переменных:

1. Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел. Присвойте ей произвольное дробное значение.
2. Создайте переменную целочисленного типа с наименьшим диапазоном чисел. Присвойте  ей наибольшее возможное значение.
 */

public class Task2 {

    public static void main(String[] args) {
        double a = 15.1327D;
        byte b = 127;
        System.out.println(a);
        System.out.println(b);
    }
}
